---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.CannotSlantAnalyticalWallError
source: html/3317acd0-2deb-4444-2bd7-99775544b885.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.CannotSlantAnalyticalWallError Property

Cannot slant a wall with an Analytical Model. Please disable the Analytical Model first.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotSlantAnalyticalWallError { get; }
```